Repository: discord-py-interactions/discord-py-interactions
Catalog: docs/locale/*/LC_MESSAGES/api.cache.po
Languages: de, fr, zh_hant

source: Client Cache
fr: Cache du client
zh_hant: 客戶端緩存

source: A class representing a set of items stored as a cache state.
de: Eine Klasse, die ein Set von Objekten, die in einem Cache-Zustand gespeichert werden, repräsentiert.
fr: Une classe représentant des éléments stockés en tant que cache.
zh_hant: 表示一組項目存儲於緩存的類別。

source: Variables
de: Variablen
zh_hant: 變數

source: The list of items stored.
de: Die Liste von gespeicherten Objekten.
fr: La liste des éléments stockés.
zh_hant: 存儲的項目列表。

source: Return type
de: Rückgabetyp.
fr: Type de retour
zh_hant: 回傳類型

source: Merges new data of an item into an already present item of the cache
de: Aktualisiert die Daten eines Objektes im Cache mit Daten eines modifizierten Objekts.
fr: Fusionne les nouvelles données d'un élément avec celles d'un élément déjà présent dans le cache.
zh_hant: 將已經存在項目的新數據合併到緩存中

source: Parameters
de: Parameter
fr: Paramètres
zh_hant: 參數

source: The item to merge.
de: Das Objekt, das eingefügt werden soll.
fr: L'élément à fusionner.
zh_hant: 合併的項目

source: The unique id of the item.
de: Die einzigartige ID des Objektes.
fr: L'ID unique de l'élément.
zh_hant: 項目的獨特ID。

source: Adds a new item to the storage.
de: Fügt ein neues Objekt in den Cache ein.
fr: Ajoute un élément au stockage.
zh_hant: 將新項目添加到緩存中。

source: The item to add.
de: Das Objekt zum Einfügen.
fr: L'élément à rajouter.
zh_hant: 添加的項目。

source: Gets an item from the storage.
de: Holt ein Objekt aus dem Speicher.
fr: Cherche un élément du stockage.
zh_hant: 從緩存中取得項目。

source: The ID of the item.
de: Die ID des Objekts.
fr: L'ID de l'élément.
zh_hant: 項目的獨特ID。

source: The default value to return if the item is not found.
de: Der Standard-Rückgabewert, der zurückgegeben werden soll, wenn das Objekt nicht gefunden wird.
fr: La valeur par défaut à retourner si l'élément n'est pas trouvé.
zh_hant: 項目不存在時回傳的預設值。

source: Returns
de: Gibt zurück
fr: Retourne
zh_hant: 回傳

source: The item from the storage if any.
de: Das Objekt aus dem Speicher, wenn vorhanden.
fr: L'élément du stockage s'il y en a un.
zh_hant: 緩存中的項目，如有。

source: Updates multiple items from the storage.
de: Aktualisiert mehrere Objekte des Speichers.
fr: Mets à jour plusieurs éléments du stockage.
zh_hant: 更新緩存中的多個項目。

source: The data to update with.
de: Die Daten, mit denen aktualisiert werden soll.
fr: Les données à mettre à jour.
zh_hant: 要更新的數據。

source: Views all items from storage.
de: Zeigt alle Objekte aus dem Speicher.
fr: Voir tout les éléments du stockage.
zh_hant: 查看緩存中的所有項目。

source: The items stored.
fr: Les éléments stockés.
zh_hant: 存儲的項目。

source: A class representing the cache. This cache collects all of the HTTP requests made for the represented instances of the class.
de: Eine Klasse, die den Cache repräsentiert. Dieser Cache sammelt alle Daten dergemachten HTTP-Anfragen.
fr: Une classe représentant le cache. Ce cache recueille toutes les requêtes HTTP effectuées pour les instances de la classe.
zh_hant: 表示緩存的類別。此緩存收集了所有對類別實例的HTTP請求。

source: A dictionary denoting the Type and the objects that correspond to the Type.
fr: Un dictionnaire indiquant le type et les objets correspondant au type.
zh_hant: 表示類型和對應於類型的對象的字典
