Repository: discord-py-interactions/discord-py-interactions
Catalog: docs/locale/*/LC_MESSAGES/api.gateway.po
Languages: de, fr

source: This section of the library maintains and handles all of the Gateway work.
de: Diese Sektion der Bibliothek betreibt und handelt die gesamte Gateway-Arbeit.
fr: Cette section de la librairie entretient et traite le fonctionnement de la Gateway.

source: A class representing the client's connection to the Gateway via. WebSocket.
de: Eine Klasse, die die Verbindung des Clients zum Gateway via WebSocket repräsentiert.
fr: Une classe représentant la connection du client à la Gateway.

source: The asynchronous event loop.
de: Der asynchrone Event-Loop.
fr: La boucle d'événement asynchrone.

source: The built-in event dispatcher.
de: Der eingebaute Event-Dispatcher.
fr: Le distributeur d'événements intégré.

source: The user-facing HTTP client.
de: Der Nutzerorientierte HTTP Client.
fr: Le client HTTP pour l'utilisateur.

source: The WebSocket data of the connection.
de: Die WebSocket Daten der Verbindung.
fr: Les données de connexion de la WebSocket.

source: Whether the connection has been closed or not.
de: Ob die Verbindung geschlossen wurde.
fr: Si la connexion a été fermée ou non.

source: The connection options made during connection.
de: Die Verbindungsoptionen
fr: Les options de connexion faites pendant la connexion.

source: The gateway intents used for connection.
de: Die Gateway-Intents, die für die Verbindung genutzt werden.
fr: Les intents de la gateway utilisés pour la connexion.

source: The contents of the application returned when ready.
de: Die Inhalte der Applikation.
fr: Le contenu de l'application renvoyé lorsqu'elle est prête.

source: The context state of a "heartbeat" made to the Gateway.
de: Der Kontext zustand eines "heartbeat".
fr: Le contexte d'un "heartbeat" envoyé à la gateway.

source: The shards used during connection.
de: Die shards, die bei der Verbindung verwendet werden.
fr: Les shards utilisés pendant la connexion.

source: The presence used in connection.
de: Die genutzte Präsenz.
fr: La présence utilisée pendant la connexion.

source: The ready state of the client as an ``asyncio.Event``.
de: Der Zustand des Bereits des Clients.
fr: L'état de disponibilité du client sous la forme d'un ``asyncio.Event``.

source: The closing task for ending connections.
de: Die End-Task zum beenden einer Verbindung.
fr: La tâche de fin pour ferme les connexions.

source: Whether the client has started.
fr: Si le client a été commencé.

source: The ID of the ongoing session.
fr: L'ID de la session actuelle.

source: The sequence identifier of the ongoing session.
de: Der Sequenz-Identifier der aktuellen session.
fr: L'identifiant de séquence de la session actuelle.

source: The latest time of the last send_packet function call since connection creation, in seconds.
de: Der letzte Zeitpunkt an dem die `send_packet` Funktion aufgerufen wurde seitdem die Verbindung begonnen wurde in Sekunden.
fr: La dernière fois que la fonction send_packet a été appelée depuis la connexion, en secondes.

source: The latest time of the last ``HEARTBEAT_ACK`` event since connection creation, in seconds.
de: Der letzte Zeitpunkt, an dem das ``HEARTBEAT_ACK` Event aufgetreten ist, seit Beginn der Verbindung, in Sekunden.
fr: La dernière fois qu'un événement ``HEATBEAT_ACK`` a été reçu depuis la connexion, en secondes.

source: The latency of the connection, in seconds.
de: Die Latenz der Verbindung, in Sekunden.
fr: La latence de la connexion, en secondes.

source: Parameters
de: Parameter
fr: Paramètres

source: Return type
de: Rückgabetyp
fr: Type de retour

source: Manages the heartbeat loop.
de: Verwaltet den Heartbeat-Loop.
fr: Gère la boucle de heartbeat.

source: Restart the client's connection and heartbeat with the Gateway.
de: Startet die Verbindung des Client neu.
fr: Redémarre la connexion du client et le heartbeat avec la gateway.

source: Establishes a client connection with the Gateway.
de: Verbindet den Client mit dem Discord Gateway.
fr: Etablis la connexion du client avec la gateway.

source: The shards to establish a connection with. Defaults to ``None``.
de: Die shards mit denen die Verbindung hergestellt werden soll. Standardwert: ``None``
fr: Les shards utilisés pour la connexion. La valeur par défaut est ``None``.

source: The presence to carry with. Defaults to ``None``.
fr: La présence à avoir. La valeur par défaut est ``None``.

source: Handles the client's connection with the Gateway.
de: Verarbeitet die Verbindung des Clients zum Gateway.
fr: Gère la connexion du client avec la gateway.

source: The packet stream to handle.
de: Das packet des streams zum verarbeiten.
fr: Les packets à traiter.

source: Waits for the client to become ready according to the Gateway.
de: Wartet bis der Client, laut dem Gateway, bereit ist.
fr: Attends que le client devienne prêt selon la gateway.

source: Dispatches an event from the Gateway.
de: Dispatcht ein Event vom Gateway.
fr: Distribue un événement de la gateway.

source: The name of the event.
de: Der Name des Events.
fr: Le nom de l'événement

source: The data for the event.
de: Die Daten für ein Event.
fr: Les données de l'événement.

source: Takes raw data given back from the Gateway and gives "context" based off of what it is.
de: Nimmt die rohen Daten vom gateway und bildet einen "Context" daraus.
fr: Prends les données brutes envoyées par la gateway et leur donne un "contexte" en fonction de ce que c'est.

source: The data from the Gateway.
de: Die Daten vom Gateway.
fr: Les données de la gateway

source: Returns
de: Gibt zurück
fr: Retourne

source: The context object.
de: Das Context Objekt.
fr: Le contexte.

source: Checks if an application command schema has sub commands needed for argument collection.
de: Überprüft, ob ein Applikations-Befehl-Schema Unterbefehle hat, um korrekte Argumente für die Funktion bereitzustellen.
fr: Vérifie si une commande possède des sous-commandes nécéssaires à la collecte d'arguments

source: The data structure of the option.
de: Die Datenstruktur der Option.
fr: La structure des données de l'option.

source: The context to refer subcommands from.
de: Der Kontext von dem auf Unterbefehle verwiesen wird.
fr: Le contexte des sous-commandes.

source: A dictionary of the collected options, if any.
de: Ein dictionary von den gesammelten Optionen, falls vorhanden.
fr: Un dictionnaires des options, s'il y en a.

source: Looks up the type of option respective to the existing option types.
de: Findet den Typ einer Option
fr: Cherche le type d'option parmi les types d'option existants.

source: The context to refer types from.
de: Der Kontext der auf verschiedene Typen verweist.
fr: Le contexte des types.

source: The option type.
de: Der Option-Typ.
fr: Le type d'option.

source: The option type context.
de: Der Option-Typ Kontext.
fr: Le contexte du type d'option

source: Receives a stream of packets sent from the Gateway.
de: Empfängt ein Stream von Paketen, gesendet vom Gateway.
fr: Reçoit un flux de packets envoyés par la gateway.

source: The packet stream.
de: Der Paket Stream.
fr: Le flux de packets.

source: Sends a packet to the Gateway.
de: Sendet ein Paket zum Gateway.
fr: Envoie un packet à la gateway.

source: The data to send to the Gateway.
de: Die Daten die zum Gateway gesendet werden sollen.
fr: Les données à envoyer à la gateway.

source: Sends an ``IDENTIFY`` packet to the gateway.
de: Sendet ein ``IDENTIFY`` Paket zum Gateway.
fr: Envoie un packet ``IDENTIFY`` à la gateway.

source: The shard ID to identify under.
de: Die shard ID, unter der man sich identifizieren kann.
fr: L'ID du shard pour s'identifier

source: The presence to change the bot to on identify.
de: Die Präsenz zu der der Bot geändert werden soll.
fr: La présence pour changer le bot en s'identifiant.

source: Sends a ``RESUME`` packet to the gateway.
de: Sendet ein ``RESUME`` Paket zum Gateway.
fr: Envoie un packet ``RESUME`` à la gateway.

source: Sends a ``HEARTBEAT`` packet to the gateway.
de: Sendet ein ``HEARTBEAT`` Paket zum Gateway.
fr: Envoie un packet ``HEARTBEAT`` à la gateway.

source: Returns the current shard
de: Gibt die aktuelle shard zurück.
fr: Retourne la shard actuelle.

source: Returns the current presence.
de: Gibt die aktuelle Präsenz zurück.
fr: Retourne la présence actuelle.

source: Sends an ``UPDATE_PRESENCE`` packet to the gateway.
de: Sendet ein ``UPDATE_PRESENFE.`` Paket zum Gateway.
fr: Envoie un packet ``UPDATE_PRESENCE`` à la gateway.

source: There is a ratelimit to using this method (5 per minute). As there's no gateway ratelimiter yet, breaking this ratelimit will force your bot to disconnect.
de: Es gibt ein Rate-Limit bei der Nutzung dieser Methode (5 mal pro Minute maximal). Da es noch keinen Gateway Rate-Limiter gibt, wird das brechen dieses Limits den Bot dazu zwingen, die Verbindung zu beenden.
fr: Il y a une limite pour utiliser cette méthode (5 par minute). Comme il n'y a pas encore de limiteur, dépasser cette limite obligera le bot à se déconnecter.

source: An internal class representing the heartbeat in a WebSocket connection.
de: Eine interne Klasse, die den Heartbeat der WebSockets-Verbindung repräsentiert.
fr: Une classe interne représent un heartbeat d'une connexion WebSocket.

source: Variables
de: Variablen
