Repository: discord-py-interactions/discord-py-interactions
Catalog: docs/locale/*/LC_MESSAGES/api.dispatch.po
Languages: de, fr, zh_hant

source: Dispatching
fr: Distribution
zh_hant: 調度中

source: A class representing how events become dispatched and listened to.
de: Eine Klasse, die repräsentiert wie Events dispatched und gehört werden.
fr: Une classe représentant la façon dont les événements sont distribués et écoutés.
zh_hant: 表示事件如何被調度和監聽的類別。

source: Variables
de: Variablen
zh_hant: 變數

source: The coroutine event loop established on.
de: Der EventLoop der Coroutine.
fr: La boucle d'évènement de la coroutine.
zh_hant: 協程事件循環

source: A list of events being dispatched.
de: Eine Liste von Events, die dispatcht werden.
fr: Une liste des événements distribués.
zh_hant: 正在調度的事件列表。

source: Return type
de: Rückgabetyp
fr: Type de retour
zh_hant: 回傳類型

source: Dispatches an event given out by the gateway.
de: Dispatcht ein Event das vom Gateway ausgegeben wurde.
fr: Distribue un événement donné par la gateway.
zh_hant: 調度一個連接器發出的事件

source: Parameters
de: Parameter
fr: Paramètres
zh_hant: 參數

source: The name of the event to dispatch.
de: Der name des Events, das dispatcht werden soll
fr: Le nom de l'événement à distribuer.
zh_hant: 調度事件的名稱

source: Multiple arguments of the coroutine.
de: Mehrere Argumente der Coroutine
fr: Les arguments de la coroutine.
zh_hant: 協程的多個參數。

source: Keyword-only arguments of the coroutine.
de: Stichwort-begrenzte Argumente der Coroutine
fr: Les arguments nommés de la coroutine.
zh_hant: 協程的關鍵字參數。

source: Registers a given coroutine as an event to be listened to. If the name of the event is not given, it will then be determined by the coroutine's name.
de: Registriert eine gegebene Coroutine als Event auf das gehört wird. Falls der Name des Events nicht gegeben ist, wird es über den Namen der Coroutine bestimmt werden
fr: Enregistre une coroutine comme un événement à écouter. Si le nom de l'événement n'est pas spécifié, il sera déterminé par le nom de la coroutine.
zh_hant: 為協程註冊要監聽的事件。如果沒有給出事件的名稱，將由協程的名稱來判斷。

source: i.e. : async def on_guild_create -> "ON_GUILD_CREATE" dispatch.
de: z.B.: async def on_guild_create -> "ON_GUILD_CREATE" dispatch.
fr: ex: async def on_guild_create -> Distribue "ON_GUILD_CREATE".
zh_hant: 例子：async def on_guild_create -> 調度 "ON_GUILD_CREATE"。

source: The coroutine to register as an event.
de: Die Coroutine, die als Event registriert werden soll
fr: La coroutine à enregistrer en tant qu'événement.
zh_hant: 註冊為事件的協程。

source: The name to associate the coroutine with. Defaults to None.
de: Der Name, der der Coroutine zugewiesen werden soll. Standard: `None`
fr: Le nom à associer à la coroutine. La valeur par défaut est None.
zh_hant: 與協程關聯的名稱。 預設為 None。
