Repository: discord-py-interactions/discord-py-interactions
Catalog: docs/locale/*/LC_MESSAGES/client.po
Languages: de

source: A class representing the client connection to Discord's gateway and API via. WebSocket and HTTP.
de: Eine Klasse, die die Verbindung des Client zu Discords Gateway und API über WebSocket und HTTP repräsentiert.

source: Parameters
de: Parameter

source: The token of the application for authentication and connection.
de: Das Token der Applikation für Authentifizierung und Verbindung.

source: Allows specific control of permissions the application has when connected. In order to use multiple intents, the | operator is recommended. Defaults to ``Intents.DEFAULT``.
de: Erlaubt spezifische Kontrolle über Berechtigungen, die die Applikation hat, wenn Verbunden. Um mehrere Intents zu nutzen, ist der ``|`` Operator empfohlen. Standardwert ist ``Intents.DEFAULT``.

source: Dictates and controls the shards that the application connects under.
de: Diktiert und Kontrolliert die shards, unter denen sich dir Applikation verbindet.

source: Sets an RPC-like presence on the application when connected to the Gateway.
de: Setzt eine RPC-ähnliche Präsenz der Applikation, wenn sie zum Gateway verbunden ist.

source: Sets the default scope of all commands.
de: Setzt den Standard scope aller Befehle.

source: Controls whether synchronization in the user-facing API should be automatic or not.
de: Kontrolliert, ob die Synchronisation von Befehlen automatisiert geschieht.

source: Variables
de: Variablen

source: The asynchronous event loop of the client.
de: Der asynchrone Event-Loop des Client.

source: The user-facing HTTP connection to the Web API, as its own separate client.
de: Die Nutzer-gerichtete HTTP-Verbindung zur Web API, als eigener Client.

source: An object-orientation of a websocket server connection to the Gateway.
de: Eine Objekt-Orientierung von einer Websocket Server Verbindung zum Gateway.

source: The Gateway intents of the application. Defaults to ``Intents.DEFAULT``.
de: Die Gateway Intents der Applikation.

source: The list of bucketed shards for the application's connection.
de: Die Liste von shards für die Verbindung der Applikation.

source: The RPC-like presence shown on an application once connected.
de: Die RPC-ähnliche Präsenz, die bei der Applikation angezeigt wird, wenn verbunden.

source: The "extensions" or cog equivalence registered to the main client.
de: Die " extensions" die beim Hauptclient registriert sind.

source: The application representation of the client.
de: Die Applikation Repräsentation des Clients.

source: Return type
de: Rückgabetyp

source: Returns a list of guilds the bot is in.
de: Gibt eine Liste aller Guilds, in denen der Bot ist, zurück.

source: Returns the connection latency in milliseconds.
de: Gibt die Latenz der Verbindung in Millisekunden zurück.

source: Starts the client session.
de: Startet die Client-Session.

source: Registers all raw gateway events to the known events.
de: Registriert alle puren Gateway-Ereignisse.

source: Compares an application command during the synchronization process.
de: Vergleicht einen Applikationsbefehl während der Synchronisation.

source: The application command to compare.
de: Der Befehl zum Vergleichen.

source: The "pool" or list of commands to compare from.
de: Der " pool" oder Liste von Befehlen zum Vergleichen.

source: Returns
de: Gibt zurück

source: Whether the command has changed or not.
de: Ob sich der Befehl geändert hat oder nicht.

source: Prepares the client with an internal "ready" check to ensure that all conditions have been met in a chronological order:
de: Bereitet den Client mit einem internen "ready" check vor um sicherzustellen, dass alle Bedingungen eingehalten wurden:

source: Makes a login with the Discord API.
de: Macht einen Login mit der Discord Api.

source: Helper method that waits until the websocket is ready.
de: Hilfsmethode, die wartet, bis der Websocket bereit ist.

source: Resolves all commands to the command coroutines.
de: Bereitet alle Befehle vor und weist sie ihrer Funktion zu.

source: This is an internal method. Do not call it unless you know what you are doing!
de: Die ist eine interne Methode. Führen Sie diese auf keinen Fall aus, wenn Sie nicht wissen, was Sie tun!

source: Synchronizes all commands to the API.
de: Synchronisiert alle Befehle zur API.

source: A decorator for listening to events dispatched from the Gateway.
de: Ein decorator zum Hören auf Events die vom Gateway dispatcht werden.

source: The coroutine of the event.
de: Die Coroutine des Events.

source: The name of the event. If not given, this defaults to the coroutine's name.
de: Der Name des Events. Wenn nicht gegeben, wird der Name der Coroutine verwendet.

source: A callable response.
de: Eine aufrufbare Antwort.

source: A method that changes the current client's presence on runtime.
de: Eine Methode, die die aktuelle Präsenz des Clients ändert.

source: There is a ratelimit to using this method (5 per minute). As there's no gateway ratelimiter yet, breaking this ratelimit will force your bot to disconnect.
de: Sie dürfen diese Methode nicht öfter als 5 mal pro Minute ausführen, da der Bot sonst abstürzen wird, da es noch keinen Gateway-Begrenzer gibt.

source: The presence to change the bot to on identify.
de: Die Präsenz, zu der der Bot geändert werden soll.

source: Checks if a command is valid.
de: Prüft ob ein Befehl gültig ist.

source: A decorator for registering an application command to the Discord API, as well as being able to listen for ``INTERACTION_CREATE`` dispatched gateway events.
de: Ein decorator, mit dem ein Befehl erstellt werden kann.

source: The structure of a chat-input command:
de: Die Struktur eines chat-input Befehls:

source: You are also able to establish it as a message or user command by simply passing the ``type`` kwarg field into the decorator:
de: Sie können über das ``type`` kwarg den Typen des Befehls verändern.

source: The ``scope`` kwarg field may also be used to designate the command in question applicable to a guild or set of guilds.
de: Mit dem ``scope`` kwarg können Sie den Befehl auf bestimme Guilds begrenzen.

source: To properly utilise the ``default_member_permissions`` kwarg, it requires OR'ing the permission values, similar to instantiating the client with Intents. For example:
de: Sie können ``default_member_permissions`` ähnlich wie Intents nutzen.Beispiel:

source: Another example below for instance is an admin-only command:
de: Ein weiteres Beispiel für einen nur-Admin Befehl:

source: If ``default_member_permissions`` is not given, this will default to anyone that is able to use the command.
de: Ist das Feld jedoch nicht gesetzt, so kann jeder den Befehl nutzen.

source: The type of application command. Defaults to :meth:`interactions.enums.ApplicationCommandType.CHAT_INPUT` or ``1``.
de: Der Typ des Befehls. Standard: Chat-Input.

source: The name of the application command. This *is* required but kept optional to follow kwarg rules.
de: Der Name des Befehls.

source: The description of the application command. This should be left blank if you are not using ``CHAT_INPUT``.
de: Die Beschreibung des Befehls. Nur benötigt bei Chat-Input Befehlen.

source: The "scope"/applicable guilds the application command applies to.
de: Die Guilds, auf denen der Befehl vorhanden sein soll.

source: The "arguments"/options of an application command. This should be left blank if you are not using ``CHAT_INPUT``.
de: Die Argumente/Optionen des Befehls. Nutzen Sie dies nur bei Chat-Input Befehlen.

source: The dictionary of localization for the ``name`` field. This enforces the same restrictions as the ``name`` field.
de: Lokalisierungen für das ``name`` Feld.

source: The dictionary of localization for the ``description`` field. This enforces the same restrictions as the ``description`` field.
de: Lokalisierungen für das ``description`` Feld.

source: The application permissions if executed in a Direct Message. Defaults to ``True``.
de: Ob der Befehl in Privatnachrichten ausführbar ist oder nicht. Standard: ausführbar.

source: Whether the scope of the command is the default scope set in the client. Defaults to ``True``.
de: Ob bei diesem Befehl ``default_scope`` verwendet werden soll. Standard: ``True``.

source: A decorator for registering a message context menu to the Discord API, as well as being able to listen for ``INTERACTION_CREATE`` dispatched gateway events.
de: Ein decorator um ein Nachrichten-Kontext-Menü zu erstellen.

source: The structure of a message context menu:
de: Die Struktur eines Nachrichten-Kontext-Menüs:

source: The name of the application command.
de: Der Name des Befehls.

source: The "scope"/applicable guilds the application command applies to. Defaults to ``None``.
de: Die Guilds, auf denen der Befehl vorhanden sein soll.

source: A decorator for registering a user context menu to the Discord API, as well as being able to listen for ``INTERACTION_CREATE`` dispatched gateway events.
de: Ein decorator um ein Nutzer-Kontext-Menü zu erstellen.

source: The structure of a user context menu:
de: Die Struktur eines Nutzer-Kontext-Menüs:

source: A decorator for listening to ``INTERACTION_CREATE`` dispatched gateway events involving components.
de: Ein decorator um auf eine genutzte Komponente zu hören.

source: The structure for a component callback:
de: Die Struktur eines Komponenten-callbacks:

source: The context of the component callback decorator inherits the same as of the command decorator.
de: Der Kontext des Component-Callbacks.

source: The component you wish to callback for.
de: Die Komponente, auf die Sie hören möchten.

source: Iterates over `commands` and returns an :class:`ApplicationCommand` if it matches the name from `command`
de: Findet einen Befehl aus allen Befehlen des Clients.

source: The name of the command to match
de: Der Name des Befehls der gefunden werden soll.

source: An ApplicationCommand model
de: Ein ApplicationCommand Modell.

source: A decorator for listening to ``INTERACTION_CREATE`` dispatched gateway events involving autocompletion fields.
de: Ein decorator, um auf Autocomplete eines Befehls zu hören.

source: The structure for an autocomplete callback:
de: Die Struktur eines Autocomplete-Callbacks:

source: The command, command ID, or command name with the option.
de: Der Befehl, Befehls ID, oder Befehlsname.

source: The name of the option to autocomplete.
de: Der Name der Option für Autocomplete.

source: A decorator for listening to ``INTERACTION_CREATE`` dispatched gateway events involving modals.
de: Ein decorator um auf ein Modal zu hören.

source: The structure for a modal callback:
de: Die Struktur eines Modal-Callbacks:

source: The context of the modal callback decorator inherits the same as of the component decorator.
de: Der Kontext des Modals.

source: The modal or custom_id of modal you wish to callback for.
de: Das Modal oder die custom ID des modals.

source: "Loads" an extension off of the current client by adding a new class which is imported from the library.
de: Lädt eine extension.

source: The name of the extension.
de: Der Name der extension.

source: The package of the extension.
de: Die package der extension.

source: Optional arguments to pass to the extension
de: Optionale Argumente, die zur extension gegeben werden sollen.

source: Optional keyword-only arguments to pass to the extension.
de: Optionale keyword Argumente, die zur extension gegeben werden sollen.

source: The loaded extension.
de: Die geladene extension.

source: Removes an extension out of the current client from an import resolve.
de: Entfernt eine geladene extension

source: Whether to remove commands before reloading. Defaults to True.
de: Ob Befehle entfernt werden sollen, bevor neu geladen wird. Standard: True.

source: "Reloads" an extension off of current client from an import resolve.
de: Lädt eine geladene Erweiterung neu.

source: This will remove and re-add application commands, counting towards your daily application command creation limit, as long as you have the ``remove_commands`` argument set to ``True``, what it is by default.
de: Dies wird Befehle des extension entfernen und neu hinzufügen, was zu Ihrem täglichen Befehls-erstellungs-Limit zählt, so lange Sie ``remove_commands`` auf ``True`` gesetzt haben, was Standardmäßig der Fall ist.

source: The name of the extension
de: Der Name der extension.

source: The package of the extension
de: Die package der extension

source: Whether to remove commands before reloading. Defaults to True
de: Ob Befehle entfernt werden sollen, bevor neu geladen wird.

source: The reloaded extension.
de: Die neu geladene extension.

source: Modify the bot user account settings.
de: Aktualisiert die Bot-Nutzer-Account Einstellungen.

source: The new username of the bot
de: Der neue Nutzername des Bots

source: The new avatar of the bot
de: Der neue Avatar des Bots

source: The modified User object
de: Das modifizierte Nutzer-Objekt

source: This is an internal function that takes any gateway socket event and then returns the data purely based off of what it does in the client instantiation class.
de: Eine interne Funktion die alle Gateway Socket Events zurückgibt.

source: The data that is returned
de: Die Daten, die zurückgegeben werden.

source: A dictionary of raw data.
de: Ein Dictionary von rohen Daten.

source: This is an internal function that caches the channel creates when dispatched.
de: Interne Funktion für das channel create event.

source: The channel object data in question.
de: Das channel Objekt.

source: The channel as a dictionary of raw data.
de: Der Channel als Dictionary.

source: This is an internal function that caches the message creates when dispatched.
de: Eine interne Funktion die Daten des message create events speichert.

source: The message object data in question.
de: Das Nachricht Objekt.

source: The message as a dictionary of raw data.
de: Die Nachricht als Dictionary.

source: This is an internal function that caches the guild creates on ready.
de: Eine interne Funktion die Daten des Guild create events speichert.

source: The guild object data in question.
de: Das guild Objekt.

source: The guild as a dictionary of raw data.
de: Der Guild as Dictionary.

source: A class that allows you to represent "extensions" of your code, or essentially cogs that can be ran independent of the root file in an object-oriented structure.
de: Eine Klasse die es Ihnen ermöglicht, eine Extension in Ihrem Code zu erstellen.

source: The structure of an extension:
de: Die Struktur einer Extension:
