Repository: discord-py-interactions/discord-py-interactions
Catalog: docs/locale/*/LC_MESSAGES/context.po
Languages: de

source: The base class of "context" for dispatched event data from the gateway. The premise of having this class is so that the user-facing API is able to allow developers to easily access information presented from any event in a "contextualized" sense.
de: Die Grundklasse des "context" für dispatchte Event Daten vom Gateway.

source: Variables
de: Variablen

source: The message data model.
de: Das Nachrichten Datenmodell

source: The member data model.
de: Das Mitglieds Datenmodell

source: The user data model.
de: Das Nutzer Datenmodell

source: The channel data model.
de: Das Kanal Datenmodell

source: The guild data model.
de: Das Guild Datenmodell

source: Parameters
de: Parameter

source: This gets the channel the context was invoked in.
de: Dies holt den channel, in dem der Context aufgerufen wurde.

source: Returns
de: Gibt zurück

source: The channel as object
de: Der Kanal als Objekt

source: Return type
de: Rückgabetyp

source: This gets the guild the context was invoked in.
de: Dies holt den Guild in den der Kontext aufgerufen wurde.

source: The guild as object
de: Der Guild als Objekt

source: This allows the invocation state described in the "context" to send an interaction response.
de: Sendet eine Nachricht als Interaktionsantwort.

source: The contents of the message as a string or string-converted value.
de: Die Inhalte der Nachricht als string.

source: Whether the message utilizes the text-to-speech Discord programme or not.
de: Ob TTS verwendet werden soll.

source: The attachments to attach to the message. Needs to be uploaded to the CDN first
de: Anhänge, die an die Nachricht angehängt werden sollen. Müssen bereits auf Discord hochgeladen sein.

source: An embed, or list of embeds for the message.
de: Die Embeds für die Nachricht.

source: The message interactions/mention limits that the message can refer to.
de: Die Erwähnungsbeschränkungen für die Nachricht.

source: A component, or list of components for the message.
de: Komponenten, die an die Nachricht angehängt werden sollen.

source: Whether the response is hidden or not.
de: Ob die Antwort versteckt ist oder nicht.

source: The sent message as an object.
de: Die gesendete Nachricht als Objekt.

source: This allows the invocation state described in the "context" to send an interaction response. This inherits the arguments of the Context ``.send()`` method.
de: Modifiziert die Nachricht. Hat alle Argumente der send Methode, außer ``ephemeral``.

source: The edited message as an object.
de: Die modifizierte Nachricht als Objekt.

source: This "pops up" a modal to present information back to the user.
de: Die öffnet ein Modal für den Nutzer.

source: The components you wish to show.
de: Die Komponenten, die Sie zeigen möchten.

source: Update an object with new attributes. All data will be converted, and any extra attributes will be put in _extras
de: Aktualisiere ein Objekt mit neuen Attributen.

source: The dictionary to update from
de: Das Dictionary von dem geupdated werden soll

source: A derivation of :class:`interactions.context.Context` designed specifically for application command data.
de: Eine Abwandlung von :class:`interactions.context.Context`, entwickelt speziell für Applikations Befehl Daten.

source: The ``guild`` attribute of the base context is not accessible for any interaction-related events since the current Discord API schema does not return this as a value, but instead ``guild_id``. You will need to manually fetch for this data for the time being.
de: Standardmäßig ist das Guild Attribut nicht gesetzt. Sie müssen es deshalb selber holen

source: You can fetch with ``client.get_guild(guild_id)`` which will return a JSON dictionary, which you can then use ``interactions.Guild(**data)`` for an object or continue with a dictionary for your own purposes.
de: Sie können über ``await ctx.get_guild()`` das Objekt holen.

source: the HTTP client
de: Der HTTP Client

source: The ID of the interaction.
de: Die ID der Interaktion.

source: The application ID of the interaction.
de: Die Applikations ID der Interaktion.

source: The type of interaction.
de: Der Typ der Interaktion.

source: The application command data.
de: Die Befehlsdaten.

source: The target selected if this interaction is invoked as a context menu.
de: Das ausgewählte Ziel, wenn die Interaktion als Kontext Menü ausgeführt wurde.

source: The token of the interaction response.
de: Das Token der Interaktionsantwort.

source: The ID of the current guild.
de: Die ID des aktuellen Guilds.

source: The ID of the current channel.
de: Die ID des aktuellen Kanals.

source: Whether an original response was made or not.
de: Ob eine originale Antwort gemacht wurde oder nicht.

source: Whether the response was deferred or not.
de: Ob die Antwort deferred war oder nicht.

source: The selected language of the user invoking the interaction.
de: Die ausgewählte Sprache des Nutzers, der die Interaktion gemacht hat.

source: The guild's preferred language, if invoked in a guild.
de: Die bevorzugte Sprache des Guilds.

source: Bitwise set of permissions the bot has within the channel the interaction was sent from.
de: Bitwise Set von Berechtigungen, die der Bot im gegebenen Kanal hat.

source: This "defers" an interaction response, allowing up to a 15-minute delay between invocation and responding.
de: Dies defert eine Interaktionsantwort und gibt Ihnen 15 Minuten Zeit um zu antworten.

source: Whether the deferred state is hidden or not.
de: Ob der deferred Zustand versteckt ist oder nicht.

source: This deletes the interaction response of a message sent by the contextually derived information from this class.
de: Löscht die getätigte Interaktionsantwort.

source: Doing this will proceed in the context message no longer being present.
de: Dadurch wird auch die gelöschte Nachricht gelöscht.

source: This "populates" the list of choices that the client-end user will be able to select from in the autocomplete field.
de: Dies populiert eine Liste von Auswahlmöglichkeiten, die der Nutzer bei einer Option mit autocomplete auswählen kann.

source: Only a maximum of ``25`` choices may be presented within an autocomplete option.
de: Es können maximal 25 Auswahlmöglichkeiten auf einmal angezeigt werden.

source: The choices you wish to present.
de: Die Auswahlmöglichkeiten, die Sie wünschen zu zeigen.

source: The list of choices you've given.
de: Die Liste von Auswahlmöglichkeiten, die Sie gegeben haben.

source: A derivation of :class:`interactions.context.CommandContext` designed specifically for component data.
de: Eine Abwandlung von :class:`interactions.context.CommandContext` entwickelt speziell für Komponenten-Daten.

source: This "defers" a component response, allowing up to a 15-minute delay between invocation and responding.
de: Dies defert eine Interaktionsantwort und gibt Ihnen 15 Minuten Zeit um zu antworten.

source: Whether you want to edit the original message or send a followup message
de: Ob sie die originale Nachricht bearbeiten wollen oder nicht.
