Repository: discord-py-interactions/discord-py-interactions
Catalog: docs/locale/*/LC_MESSAGES/ext.*.po
Languages: de

source: Core Model
de: Kernmodell

source: A class representing the base structure of a 3rd party.
de: Eine Klasse, die die Grundstruktur einer 3rd-Party, repräsentiert.

source: Variables
de: Variablen

source: The version of the library.
de: Die Version der Bibliothek.

source: The name of the library.
de: Der Name der Bibliothek

source: The description of the library.
de: Die Beschreibung der Bibliothek

source: The long description of the library.
de: Die lange Beschreibung der Bibliothek

source: The repository link or the library.
de: Der Repository-Link der Bibliothek.

source: The packages of the library.
de: Die packages der Bibliothek.

source: The modules in the library required.
de: Die Module, die die Bibliothek anfordert.

source: The objects running under the service.
de: Die Objekte, die unter dem Service laufen.

source: Parameters
de: Parameter

source: Return type
de: Rückgabetyp

source: Checks whether the service already exists within the list or not.
de: Prüft, ob der Service bereits in der Liste existiert oder nicht.

source: The name of the service to check.
de: Der Name des Services zum prüfen.

source: Returns
de: Gibt zurück

source: Whether the service exists or not.
de: Ob der Service existiert oder nicht.

source: Adds a service to the 3rd party for ease of accessibility in calling. The code theory behind this is to simplify the way you handle and manage the calling of other objects, as well as accessing their information.
de: Fügt einen service als 3rd-Party hinzu. Erleichtert das Aufrufen anderer Objekte.

source: The object to add as a service.
de: Das Objekt, das als Service hinzugefügt werden soll.

source: The name of the object to map under.
de: Der Name des Objekts zum Mappen.

source: The mapped relation between the object and name.
de: Die gemappte Beziehung zwischen Objekt und name.

source: Removes a service from the 3rd party in the event that it is no longer needed to be referred to for data.
de: Entfernt einen Service von einer 3rd-Party.

source: The name of the service to remove.
de: Der Name des Services zu entfernen.

source: If the service has been removed or not.
de: Ob der Service entfernt wurde oder nicht.

source: Raises
de: Raist

source: An unknown service in the base.
de: Ein unbekannter Service in der Base.

source: Returns a view on all of the services currently stored under the 3rd party.
de: Gibt eine Ansicht aller Service in der 3rd-Party zurück.

source: A dictionary of objects sorted by their name.
de: Ein Dictionary von Objekten sortiert bei ihrem Namen.

source: Builds the base 3rd party the same way as ``setup`` from ``setuptools``.
de: Baut die Base-3rd-Party, wie ``setup`` von ``setuptools``.
