Repository: discord-py-interactions/discord-py-interactions
Catalog: docs/locale/*/LC_MESSAGES/get.po
Languages: de

source: The ``get`` utility method
de: Die ``get`` Methode

source: Helper method to get an object.
de: Hilfsmethode um ein Objekt zu holen

source: This method can do the following:
de: Diese Methode kann das Folgende:

source: Get a list of specific objects
de: Eine Liste spezifischer Objekte holen

source: purely from cache
de: nur aus dem Cache

source: purely from HTTP
de: nur über HTTP

source: from cache and additionally from HTTP for every ID that was not found in cache
de: vom Cache und zusätzlich über HTTP holen, für jedes Objekt das nicht im Cache gefunden wurde.

source: Get a single specific object
de: Ein einzelnes spezifisches Objekt holen

source: from HTTP if not found in cache else from cache
de: über HTTP wenn nicht im Cache sonst vom Cache

source: The method has to be awaited when:
de: Diese Methode muss ``await``ed werden wenn:

source: You don't force anything
de: Sie nichts erzwingen

source: You force HTTP
de: Sie HTTP erzwingen

source: The method doesn't have to be awaited when:
de: Die Methode muss nicht ``await``ed werden wenn:

source: You force cache
de: Sie Cache erzwingen

source: Technically, there is no need for an ``await`` if there is an object found in the cache. Because of the fact, that, as long as you don't enforce the cache, the function will get the object from HTTP, if it is not in the cache, you still have to await it. This has been done to reduce confusion on whether the object origins from an HTTP call or a cache result and to remove the extra step for you to check if the returned object is an awaitable or not.
de: Technisch gesehen gibt es keine Notwendigkeit für ein ``await``, wenn ein Objekt im Cache gefunden wurde. Aufgrund der Tatsache, dass, so lange Sie nicht Cache erzwingen, die Funktion ein Objekt über HTTP holen wird, wenn es nicht im Cache ist, müssen Sie ``await`` trotzdem verwenden. Dies wurde getan, um Verwirrung bei Entwicklern zu reduzieren, ob das Objekt nun von HTTP oder Cache stammt und den extra Schritt, zu überprüfen ob das objekt eine ``awaitable`` oder nicht ist, zu entfernen.

source: Forcing:
de: Erzwingen:

source: Forcing can be done via the ``force`` keyword argument.
de: Erzwungen werden kann über das ``force`` Keyword-Argument.

source: ``force="cache"`` or ``force=interactions.Force.CACHE``:
de: ``force="cache"`` oder ``force=interactions.Force.CACHE``:

source: This forces the method to only return from cache (if the object is not found it will return ``None``). If you use this, you don't need to await the method.
de: Dies zwingt die Methode nur vom Cache zurückzugeben (wenn das Objekt nicht gefunden wird, wird ``None`` zurückgegeben). Wenn Sie dies nutzen, müssen Sie die Methode nicht ``await``en.

source: ``force="http"`` or ``force=interactions.Force.HTTP``:
de: ``force="http"`` oder ``force=interactions.Force.HTTP``:

source: This forces the method to make an HTTP request to the discord API and return the result of it. If you use this, you have to await the method.
de: Dies zwingt die Methode eine HTTP-Anfrage zur Discord-API zu machen und das Ergebnis zurückzugeben. Wenn Sie dies nutzen, muss die Methode ``await``ed werden.

source: If you are a PyCharm user, please be aware of a bug that causes incorrect suggestions to appear if using an enum. Even if PyCharm shows a normal object as result, you have to await the method if you enforce HTTP. To prevent this bug from happening it is suggested using ``force="http"`` instead of the enum.
de: Sollten Sie PyCharm nutzen, bitten wir Sie anstatt ``force=interactions.Force.HTTP`` ``force="http"`` zu nutzen, da es einen Bug in PyCharm gibt, der das anzeigen korrekter Rückgabewerte ansonsten verhindert.

source: Getting an object:
de: Ein Objekt holen:

source: Here you will see two examples on how to get a single objects and the variations of how the object can be gotten.
de: Hier können Sie zwei Beispiele sehen, wie man ein einzelnes Objekt holen kann:

source: Example 1/2: Getting a Channel:
de: Beispiel 1/2: Einen Channel holen:

source: Example 2/2: Getting a Member:
de: Beispiel 2/2: Ein Mitglied holen:

source: Both examples should have given you a basic overview on how to get a single object. Now we will move on with lists of objects.
de: Beide Beispiele sollten Ihnen eine grundlegende Übersicht gegeben haben, wie man ein einzelnes Objekt holen kann. Nun werden wir mit Listen von Objekten weitermachen.

source: The ``parent_id`` represents the channel or guild id that belongs to the objects you want to get. It is called ``parent_id`` because ``guild_or_channel_id`` would be horrible to type out every time.
de: Die ``parent_id`` repräsentiert die Kanal oder Guild ID, die zum Objekt gehört, das sie holen wollen. Es ist so genannt, da ``guild_or_channel_id`` grausam zum schreiben gewesen wäre.

source: Getting a list of an object:
de: Eine Liste von Objekten holen:

source: Here you will see 1 example of how to get a list of objects. The possibilities on how to force (and their results) are the same as in the examples above.
de: Hier werden Sie 1 Beispiel sehen, wie man eine Liste von Objekten holt. Die Möglichkeiten wie erzwungen wird sind die gleichen wie oben.

source: Example 1/1: Getting a list of members:
de: Beispiel 1/1: Eine Liste von Mitgliedern Holen

source: If you enforce cache when getting a list of objects, found objets will be placed into the list and not found objects will be placed as ``None`` into the list.
de: Falls sie Cache erzwingen, während sie eine Liste von Objekten holen, so werden nicht gefundene Objekte als ``None`` in die Liste gesetzt.

source: Parameters
de: Parameter

source: Return type
de: Rückgabetyp

source: An enumerable object representing the force types for the get method.
de: Ein aufzählbares Objekt, dass die Zwangstypen für die Get-Methode repräsentiert.

source: Variables
de: Variablen

source: Enforce the usage of cache and block the usage of http
de: Erzwingt die Nutzung von Cache und blockiert HTTP

source: Enforce the usage of http and block the usage of cache
de: Erzwingt die Nutzung von HTTP und blockiert Cache

source: Member Type
de: Mitgliedstyp

source: Valid values are as follows:
de: Zulässige Werte sind wie folgt:

source: The :class:`~enum.Enum` and its members also have the following methods:
de: Die :class:`~enum.Enum` und ihre Mitglieder haben auch die folgenden Methoden:
