Repository: discord-py-interactions/discord-py-interactions
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: de

source: Pages:
de: Seiten:

source: Ever since December 2019, this open-source project has become the culmination of dedication and research towards figuring out the best way to bring **interactions from Discord to you:** we are an easy, simple, scalable and modular library for Discord interactions.
de: Seit Dezember 2019 wurde dieses open-source Projekt der Höhepunkt von Hingabe und Forschung, um den besten Weg zu finden, **Interaktionen von Discord zu Ihnen zu bringen:** Wir sind eine Einfache, Simple, Skalierbar und Modulare Bibliothek für Discord Interaktionen.

source: Tired of using numerous module dependencies for slash commands and buttons?
de: Sind Sie müde, verschiedene Module für slash Befehle und Knöpfe zu verwenden?

source: Looking for a compatible library that implements all interactions?
de: Suchen Sie eine kompatible Bibliothek, die alle Interaktionen implementiert?

source: Itching to get your hands on slash commands, but in a simple manner?
de: Juckt es Ihnen in den Händen slash Befehle auf eine simple Art zu nutzen?

source: Look no more! The goal of this library is to make all three of these questions go from possibilites to trivial matters.
de: Sie müssen nicht weitersuchen! Das Ziel dieser Bibliothek ist es, all diese Fragen von Möglichkeiten zur Realität zu machen.

source: What can we do?
de: Was können wir tun?

source: Our library---inside and out, offers numerous benefits and presents itself as a worthy module in your bot's dependencies:
de: Unsere Bibliothek---von innen und außen, bietet zahlreiche Vorteile und Geschenke selbst als würdiges Modul in den dependencies Ihres Bots:

source: The base features of our library, built with our API include:
de: Die grundlegenden Funktionen unserer Bibliothek, mit unserer API eingeschlossen:

source: **Dynamic object data generation**: all event data dispatched from the Gateway is dynamically transformed and generated into two-way serializable JSON objects.
de: **Dynamische Objektdatengeneraion**: Die Gesamtheit der Event-Daten, die vom Gateway dispatcht werden, werden dynamisch transformiert und in zwei-weg serialisierbare JSON-Objekte generiert.

source: **Sane rate limiting**: our HTTP client implements pre-emptive rate limit avoidance, so your bot is guaranteed to never hit HTTP ``429``.
de: **Sichere Ratenbegrenzung**: Unser HTTP-Client implementiert präventive Ratenbegrenzungsvermeidung, so dass garantiert wird, dass ihr Bot niemals ``HTTP 429``(too many requests) erreicht.

source: **On-demand cache**: every HTTP request and Gateway event made is cached when needed, so you never have to save information yourself.
de: **Cache auf Abfrage**: Jede HTTP-Anfrage und jedes Gateway Event erhalten wird im Cache gespeichert, wenn benötigt, so dass für Sie keine Notwendigkeit besteht, Informationen selber zu speichern.

source: **Simplified data models**: every object presented is accessible as either a raw dictionary/``application/json`` or list of recursive attributes.
de: **Vereinfachte Daten Modelle**: Jedes Objekt, das präsentiert wird, ist sowohl als rohes Dictionary/``application/json`` als auch als Liste von rekursiven Attributen vorhanden.

source: Some more unique features that are exclusive to our interactions include:
de: Einige weitere einzigartige Funktionen, die exclusive zu unseren Interaktionen sind, schließen ein:

source: **Event-triggered callbacks**: whether a component, application command or interaction response, you'll never need to worry about bridging responses.
de: **Event-getriggerte Callbacks**: Ob eine Komponente, ein Applikationsbefehl oder eine Interaktionsantwort, Sie müssen sich niemals darum sorgen, antworten zu überbrücken.

source: **Dual-way decorator logic**: a decorator can act as both a constructor for an interaction, as well as a callback.
de: **Zwei-weg Decorator Logik**: Ein Decorator kann sowohl als Konstruktor für eine Interaktion, als auch als Callback für diese Interaktion dienen.

source: **API-strict naming**: no more confusion with the naming approach of many libraries; we follow the naming style of interactions from the officially curated Discord Developers documentation.
de: **API-gebundene Namensgebung**: Keine Verwirrung mit dem Namensgebungsansatz vieler Bibliotheken; wir folgen dem Namensgebungs-Style der offiziellen Discord-Entwickler-Dokumentation.

source: **Extensive framework structure**: build your own tools and technologies for our library to develop and integrate community creations.
de: **Umfangreiche Framework Struktur**: Bauen Sie Ihre eigenen Werkzeuge und Technologien für unsere Bibliothek zum entwickeln und einbauen von Gemeinschafts Kreationen.

source: What do we not offer?
de: Was stellen wir nicht bereit?

source: While we certainly offer a lot of benefits, we unfortunately have our own downsides:
de: Während wir viele Vorteile bereitstellen, haben wir leider auch unsere Nachteile:

source: This list is subject to change as time goes on: some of these items may be added to the core of the library in the future.
de: Diese Liste kann sich mit der Zeit ändern.

source: No native cooldown decorator/method.
de: Keine native Cooldown Dekoratoren/Methoden, allerdings als Erweiterung vorhanden.

source: Lack of automatic sharding and voice clients.
de: Fehlen von automatischem sharding (Erweiterung vorhanden) und Voice Clients (Erweiterung in Entwicklung).

source: Where do I start?
de: Wo kann ich anfangen?

source: Please look at our pages below to find out where to go.
de: Bitte schauen Sie auf unsere Seiten unten, um herauszufinden wohin zu gehen.

source: How can I contribute?
de: Wie kann ich beitragen?

source: Please read up on our `contribution requirements`_ for the project. This open-source project also enforces the `MIT License`_.
de: Bitte lesen Sie unsere `contribution requirements`_ für das Projekt. Dieses open-source Projekt vollstreckt außerdem die `MIT License`_.

source: This open-source project utilizes the following workflows for development:
de: Dieses open-source Projekt nutzt die folgenden Workflows für Entwicklung:

source: **pre-commit** ``2.20.0``: the architecture uses this before every commit to format and check for severity/QOL-breaking changes.
de: **pre-commit**: Die Architektur nutzt dies vor jedem Commit zum Formatieren und überprüfen von Problemen.

source: **Sphinx** ``4.4.0``: all of our documentation is powered off of autogenerated documentation of the Sphinx engine.
de: **Sphinx**: Generiert unsere Dokumentation.

source: **Conventional Commits** ``1.0.0``: every commit that we make to our branches use the official specification of CC 1.0.0 to make git graphs easier when improving and refining communication between code reviews, Pull Requests and commits.
de: **Conventional Commits**: Jeder unserer commits sollte diesem entsprechen.

source: When can I start?
de: Wann kann ich anfangen?

source: We also have some extra ground rules about making any specific contributions involving:
de: Wir haben auch einige Grundregeln über spezifische Beiträge:

source: We do not accept abstraction-based requests. (e.g. ``colour`` for ``color``)
de: Wir akzeptieren keine Abstraktions-basierten Anfragen.

source: A request has to be approved by at least one developer.
de: Mindestens ein Entwickler muss die Anfrage akzeptieren.

source: You must be willing to change/adhere to reviews from participants **where necessary.**
de: Sie müssen einverstanden sein, ihren Beitrag gemäß Ansichten von Beitragenden anzupassen, **wenn und wo nötig**.

source: I think I'm all ready!
de: Ich glaube ich bin bereit!

source: Feel free to begin making `Pull Requests`_ and `Issues`_ on our GitHub!
de: Fühlen Sie sich frei anzufangen, `Pull Requests`_ und `Issues`_ auf unserem GitHub zu machen!

source: Advanced Search
de: Fortgeschrittene Suche
