Repository: discord-py-interactions/discord-py-interactions
Catalog: docs/locale/*/LC_MESSAGES/migration.po
Languages: de

source: This page aims to serve as a guide towards helping users understand any breaking or otherwise important design choices made between versions to guide towards easy migration between one another.
de: Diese Seite zielt darauf ab, dem Nutzer als Führer zu dienen und ihm schwerwiegende oder anderwertige wichtige Design-Änderungen, die zwischen Versionen gemacht wurden, zu zeigen und es ihm zu erleichtern, diese einzubauen.

source: The biggest major change between these two versions is the way ``HTTPClient`` and modelled API schema objects are used. In ``4.0.2``, a new ``_client`` attribute is added in model objects in order to use helper methods. This will not be needed if you're working with dispatched events from the Gateway, however, manually generating your own model object for use will need it appended as a key-word argument. The example below shows this change:
de: Die gröte Änderung zwischen diesen beiden Versionen ist die Art, in der ``HTTPClient`` und moddelierte API-schema Objekte genutzt werden. In ``4.0.2`` wurde ein neues ``_client`` Attribut zu den Modell-Objekten hinzugefügt, damit Hilfsmethoden benutzbar sind. Dies ist nicht benötigt, sofern es sich um ein Event handelt, dass vom Gateway dispatcht wurde, sollten Sie jedoch manuell ein Modell generieren, so müssen Sie das Attribut selber einfügen. Dieses Beispiel zeigt die Änderung:

source: This change was added in favor for being able to use endpoints in an abstracted state.
de: Diese Änderung wurde hinzugefügt, damit Endpunkte in einem abstrahierten Zustand genutzt werden können.

source: ``4.1.0`` introduces numerous breaking changes that affect the bot developers' ability to work with mainly modifying the way our Gateway processes information, as well as supplying a ``reason`` argument to ``HTTPClient``-based methods.
de: ``4.1.0`` leitet zahlreiche Breaking-Änderungen ein, die die Fähigkeit des Bot-Entwicklers zu Arbeiten betreffen, jedoch hauptsächlich durch Modifikationen wie unser Gateway Informationen verarbeitet.

source: In this version, you are no longer required to give a ``reason`` for every HTTP request. You can instead send it as an optional, which will work to keep any existing modifications of our codebase from breaking.
de: In dieser Version ist es auch nicht länger nötig, für jede HTTP-Anfrage eine ``reason`` zu geben.

source: Additionally, modifying the way information is dispatched from the Gateway must be done like this now:
de: Zusätzlich muss eine Modifizierung von Informationen die vom Gateway dispatcht werden auf diese Weise vorgenommen werden:

source: We recommend that working in correspondence with this, you should be making use of our ``interactions.ext`` SDK framework.
de: Wir empfehlen, dass Sie auch unser ``interactions.ext`` SDK-Framework nutzen sollten.

source: A slight, yet another breaking change we made was dundering numerous attributes in our internal models. You will now need to refer to the client's HTTP object as ``_http`` instead of ``http``. In order to view the full list of these, we highly encourage you to view the documentation readily available.
de: Eine weitere kleine, aber trotzdem schwerwiegende Änderung ist die Umbenennung des ``http`` Attributs des ``Client``. Es wurde zu ``_http`` geändert.

source: The last, and most major change is the introduction of the ``MESSAGE_CONTENT`` privileged intent in the library. Because of ``4.1.0`` using version 10 of the Discord API, this intent is now required for reading all message content. In order to make sure your bot works still, you will need to enable this intent in your bot's developer portal and add the intent to your current intents when connecting:
de: Die letzte und größte Änderung ist die Einführung des ``MESSAGE_CONTENT`` priviliged-intents in die Bibliothek. Da wir mit ``4.1.0`` Version 10 der Discord API nutzen, ist dieser Intent nun erforderlich, um Inhalte von Nachrichten lesen zu können:

source: A new feature was added; an event called ``on_start``. Unlike ``on_ready``, this event is only dispatched when the bot is first started.
de: Eine neue Funktion wurde hinzugefüht; ein Event namens ``on_start``. Im gegensatz zu ``on_ready`` wird dieses Event nur beim ersten Start des Botsdispatcht.

source: Instead of using the ``on_ready`` event and a check to only run code once:
de: Anstatt das ``on_ready`` Event zu nutzen und einen Check zu haben um Code nur einmal auszuführen:

source: You can now utilize the ``on_start`` event to achieve the same goal:
de: Könenn Sie nun das ``on_start`` Event nutzen, um das Selbe zu erreichen:

source: Another big change in this release is the implementation of the ``get`` utility method. It allows you to no longer use ``**await bot._http...``.
de: Eine weitere große Änderung in dieser Veröffentlichugn ist der Einbau der ``get`` Funktion. Es erlaubt, `**await bot._http...`` zu ersetzen.

source: You can get more information by reading the `get-documentation`_.
de: Sie können mehr Informationen erhalten, wenn Sie die `get-documentation`_ lesen.

source: ``4.3.0`` also introduces a new method of creating commands, subcommands, and options. There are also numerous new features, such as a default scope and utilities.
de: ``4.3.0`` führt zusätzlich eine neue Methode zum Erstellen von Befehlen, Unterbefehlen und Optionen zu erstellen. Auch gibt es zahlreiche Funktionen, wie Standard-Scope und utilities.

source: The following example shows and explains how to create commands effortlessly and use new features mentioned above:
de: Das folgende Beispiel zeigt und erklärt wie man Befehle mithilfe der neuen Funktionen erstellen kann:

source: Another change in ``4.3.0``: We added converters! These allow you name your argument in your function differently than your option name! Example:
de: Noch eine Änderung in ``4.3.0``: Wir haben converter hinzugefügt! Diese erlauben es Ihnen, das Argument in Ihrer Funktion anders zu benennen als Ihre Option. Beispiel:
