Repository: discord-py-interactions/discord-py-interactions
Catalog: docs/locale/*/LC_MESSAGES/models.utils.po
Languages: de

source: A decorator that automatically defers a command if it did not respond within ``delay`` seconds.
de: Ein Dekorator der automatisch einen Befehl defert, wenn dieser nicht innerhalb von ``delay`` Sekunden geantwortet hat.

source: The structure of the decorator is:
de: Die Struktur des Dekorators ist:

source: Parameters
de: Parameter

source: The amount of time in seconds to wait before defering the command. Defaults to ``2`` seconds.
de: Wie lange vor dem deferren gewartet werden soll. Standard: ``2`` Sekunden.

source: Whether the command is deferred ephemerally. Defaults to ``False``.
de: Ob der Befehl ephemeral defert ist. Standard: ``False``.

source: Whether the command is deferred on origin. Defaults to ``False``.
de: Ob der Befehl auf origin defert ist. Standard: ``False``.

source: Returns
de: Gibt zurück

source: The inner function, for decorating.
de: Die innere Funktion.

source: Return type
de: Rückgabetyp

source: A helper function that spreads components into :class:`ActionRow`s.
de: Eine Hilfsfunktion die Komponenten in :class:`ActionRow`s teilt.

source: Example:
de: Beispiel:

source: You can only pass in :class:`ActionRow`s, :class:`Button`s, and :class:`SelectMenu`s, but in any order.
de: Sie könenn nur :class:`ActionRow`s, :class:`Button`s, und :class:`SelectMenu`s eingeben, aber in sämtlicher Reihenfolge.

source: The components to spread.
de: Die Komponenten zum aufteilen.

source: The maximum number of components in a single row. Defaults to ``5``.
de: Die maximale Zahl an Komponenten in einer Reihe. Standard: ``5``.
