Repository: discord-py-interactions/discord-py-interactions
Catalog: docs/locale/*/LC_MESSAGES/models.misc.po
Languages: de

source: Miscellaneous Models
de: Sonstige Modelle

source: A class representing the resolved information of an interaction data.
de: Eine Klasse, die aufgelöste Informationen von Interaktiondaten repräsentiert.

source: Variables
de: Variablen

source: The resolved users data.
de: Die aufgelösten Nutzerdaten.

source: The resolved members data.
de: Die aufgelösten Mitgliedsdaten.

source: The resolved roles data.
de: Die aufgelösten Rollendaten.

source: The resolved channels data.
de: Die aufgelösten Kanaldaten.

source: The resolved messages data.
de: Die aufgelösten Nachrichtendaten.

source: The resolved attachments data.
de: Die aufgelösten Anhangsdaten.

source: Parameters
de: Parameter

source: A class object representing the data of an interaction.
de: Eine Klasse, die Daten einer Interaktion repräsentiert.

source: The ID of the interaction data.
de: Die ID der Interaktionsdaten.

source: The name of the interaction.
de: Der Name der Interaktion.

source: The type of command from the interaction.
de: Die Art des Befehls der Interaktion.

source: The resolved version of the data.
de: Die aufgelöste Version der Daten.

source: The options of the interaction.
de: Die Optionen der Interaktion.

source: The custom ID of the interaction.
de: Die custom ID der Interaktion.

source: The type of component from the interaction.
de: Die Art der Komponente der Interaktion.

source: The values of the selected options in the interaction.
de: Die Daten der ausgewählten Option in der Interaktion.

source: The targeted ID of the interaction.
de: Die targeted ID der Interaktion.

source: A class object representing an interaction.
de: Eine Klasse, die eine Interaktion repräsentiert.

source: The ID of the interaction.
de: Die ID der Interaktion.

source: The application's ID of the interaction.
de: Die ID der Applikation der Interaktion.

source: The type of interaction.
de: Der Typ der Interaktion.

source: The data of the interaction.
de: Die Daten der Interaktion.

source: The guild ID of the interaction.
de: Die Guild ID der Interaktion.

source: The channel ID of the interaction.
de: Die Kanal ID der Interaktion.

source: The member who invoked the interaction.
de: Das Mitglied, das die Interaktion ausgeführt hat.

source: The user who invoked the interaction.
de: Der Nutzer, der die Interaktion ausgeführt hat.

source: The token of the interaction.
de: Das Token der Interaktion-

source: The version of the interaction as an autoincrement identifier.
de: Die Version der Interaktion als selsbterhöhender Identifier.

source: The message of the interaction.
de: Die Nachricht der Interaktion
